<?php
/**
 * Created by PhpStorm.
 * User: majid
 * Date: 12/20/17
 * Time: 2:18 PM
 */

namespace App\Constants;


class TagConstants
{
    const KHALIGEFARS = [
        'name'  => 'خلیج فارس',
        'tag'   => 'خلیج_فارس',
        'clubs' => [
            [
                'name' => 'استقلال',
                'tag'  => 'استقلال',
            ],
            [
                'name' => 'پرسپولیس',
                'tag'  => 'پرسپولیس',
            ],
            [
                'name' => 'تراکتور',
                'tag'  => 'تراکتور',
            ],
            [
                'name' => 'سپاهان',
                'tag'  => 'سپاهان',
            ],
            [
                'name' => 'فولاد',
                'tag'  => 'فولاد',
            ],
            [
                'name' => 'نساجی',
                'tag'  => 'نساجی',
            ],
            [
                'name' => 'ذوب آهن',
                'tag'  => 'ذوب_آهن',
            ],
        ],
    ];

    const PREMIERLEAGUE = [
        'name'  => 'لیگ جزیره',
        'tag'   => 'لیگ_جزیره',
        'clubs' => [
            [
                'name' => 'آرسنال',
                'tag'  => 'آرسنال',
            ],
            [
                'name' => 'لیورپول',
                'tag'  => 'لیورپول',
            ],
            [
                'name' => 'چلسی',
                'tag'  => 'چلسی',
            ],
            [
                'name' => 'منچستر سیتی',
                'tag'  => 'منچستر_سیتی',
            ],
            [
                'name' => 'منچستر یونایتد',
                'tag'  => 'منچستر_یونایتد',
            ],
            [
                'name' => 'تاتنهام',
                'tag'  => 'تاتنهام',
            ],
        ],
    ];

    const CALCIO = [
        'name'  => 'سری آ',
        'tag'   => 'سری_آ',
        'clubs' => [
            [
                'name' => 'اینتر',
                'tag'  => 'اینتر',
            ],
            [
                'name' => 'رم',
                'tag'  => 'رم',
            ],
            [
                'name' => 'فیورنتینا',
                'tag'  => 'فیورنتینا',
            ],
            [
                'name' => 'میلان',
                'tag'  => 'میلان',
            ],
            [
                'name' => 'ناپولی',
                'tag'  => 'ناپولی',
            ],
            [
                'name' => 'یوونتوس',
                'tag'  => 'یوونتوس',
            ],
        ],
    ];

    const BUNDESLIGA = [
        'name'  => 'بوندس لیگا',
        'tag'   => 'بوندس_لیگا',
        'clubs' => [
            [
                'name' => 'بایرن مونیخ',
                'tag'  => 'بایرن_مونیخ',
            ],
            [
                'name' => 'دورتموند',
                'tag'  => 'دورتموند',
            ],
            [
                'name' => 'شالکه',
                'tag'  => 'شالکه',
            ],
            [
                'name' => 'بایرلورکوزن',
                'tag'  => 'بایرلورکوزن',
            ],
        ],
    ];

    const LALIGA = [
        'name'  => 'لالیگا',
        'tag'   => 'لالیگا',
        'clubs' => [
            [
                'name' => 'رئال مادرید',
                'tag'  => 'رئال_مادرید',
            ],
            [
                'name' => 'بارسلونا',
                'tag'  => 'بارسلونا',
            ],
            [
                'name' => 'اتلتیکو مادرید',
                'tag'  => 'اتلتیکو_مادرید',
            ],
            [
                'name' => 'والنسیا',
                'tag'  => 'والنسیا',
            ],
            [
                'name' => 'سویا',
                'tag'  => 'سویا',
            ],
        ],
    ];

}